create or replace FUNCTION KP930A07給与控除比較 
(
    i_会社コード           IN            VARCHAR2,
    i_給与支払年月_当月    IN            NUMBER,
    i_給与支払年月_前月    IN            NUMBER,
    i_プログラムID         IN            VARCHAR2,
    i_担当者コード         IN            NUMBER,
    o_処理件数             OUT           NUMBER,
    o_正常件数             OUT           NUMBER,
    o_異常件数             OUT           NUMBER,
    oErrorMesg             OUT           VARCHAR2
) RETURN NUMBER IS 
    -----------------------------------------------------------
    -- ★☆★  定数宣言部  ★☆★ --
    -----------------------------------------------------------
    -- 戻り値
    rtn正常         CONSTANT NUMBER(1) := ( 1 );
    rtn異常         CONSTANT NUMBER(1) := ( -1 );
    rtnデータなし   CONSTANT NUMBER(1) := ( 0 );

    差異_なし       CONSTANT VARCHAR2(2)  := '';
    差異_あり       CONSTANT VARCHAR2(10) := 'あり';
    差異_当月なし   CONSTANT VARCHAR2(10) := '当月なし';
    差異_前月なし   CONSTANT VARCHAR2(10) := '前月なし';

    -- 致命的なエラー
    致命エラー      EXCEPTION;

    -----------------------------------------------------------
    -- ★☆★  変数宣言部  ★☆★ --
    -----------------------------------------------------------
    給与控除額Rec   C0930前月当月給与控除額比較%ROWTYPE;

    差異            C0930前月当月給与控除額比較.差異%TYPE;

    rtn             NUMBER(1);          -- 関数戻り値

    -----------------------------------------------------------
    -- ★☆★  内部ファンクション  ★☆★ --
    -----------------------------------------------------------
    CURSOR CUR給与明細マスタ(p_会社コード VARCHAR2, p_給与支払年月_当月 NUMBER, p_給与支払年月_前月 NUMBER) IS
        SELECT
            '' AS 差異,
            T1.給与支払年月 AS 給与支払年月,
            T1.社員番号 AS 社員番号,
            ( T1.所属1
              || T1.所属2
              || T1.所属3
              || T1.所属4
              || T1.所属5 ) AS 所属コード,
            T1.氏名 AS 戸籍氏名カナ,
            T1.給与区分 AS 給与区分,
            T1.誕生生年月日 AS 生年月日,
            TRUNC((TO_CHAR(T1.給与支払年月)
                   || '01' - TO_CHAR(T1.誕生生年月日, 'YYYYMMDD')) / 10000, 0) AS 年齢,
            T1.入社年月日 AS 入社年月日,
            T1.退職年月日 AS 退職年月日,
            T1.休職年月日 AS 休職年月日,
            T1.復職年月日 AS 復職年月日,
            T1.税区分 AS 税区分,
            T2.通称氏名 AS 氏名,
            T2.通称氏名カナ AS 氏名カナ,
            T2.戸籍氏名 AS 戸籍氏名,
            T3.基本文字5_5 AS 雇用区分,
            T3.基本文字5_1 AS 職掌,
            T3.基本文字5_2 AS 職階,
            T3.入社年月日2 AS 入社年月日2,
            T3.共通文字1_4 AS 出向区分,
            T3.共通文字1_5 AS 海外出向区分,
            T4.所属名 AS 所属名称
        FROM
            給与明細マスタ項目1 T1
            INNER JOIN (
                SELECT
                    会社コード,
                    社員番号,
                    給与支払年月
                FROM
                    給与明細マスタ項目1
                WHERE
                    会社コード = p_会社コード
                    AND 給与支払年月 = p_給与支払年月_前月
            ) T5 ON T1.会社コード = T5.会社コード  AND T1.社員番号 = T5.社員番号
            LEFT JOIN 給与明細マスタ項目3 T2 ON T1.会社コード = T2.会社コード
                               AND T1.給与支払年月 = T2.給与支払年月
                               AND T1.社員番号 = T2.社員番号
            LEFT JOIN 給与明細付録項目 T3 ON T1.会社コード = T3.会社コード
                             AND T1.給与支払年月 = T3.給与支払年月
                             AND T1.社員番号 = T3.社員番号
            LEFT JOIN 給与明細漢字データ項目 T4 ON T1.会社コード = T4.会社コード
                                AND T1.給与支払年月 = T4.給与支払年月
                                AND T1.社員番号 = T4.社員番号
        WHERE T1.会社コード = p_会社コード AND T1.給与支払年月 = p_給与支払年月_当月
        UNION ALL
        SELECT
            '前月なし' AS 差異,
            T1.給与支払年月 AS 給与支払年月,
            T1.社員番号 AS 社員番号,
            ( T1.所属1
              || T1.所属2
              || T1.所属3
              || T1.所属4
              || T1.所属5 ) AS 所属コード,
            T1.氏名 AS 戸籍氏名カナ,
            T1.給与区分 AS 給与区分,
            T1.誕生生年月日 AS 生年月日,
            TRUNC((TO_CHAR(T1.給与支払年月)
                   || '01' - TO_CHAR(T1.誕生生年月日, 'YYYYMMDD')) / 10000, 0) AS 年齢,
            T1.入社年月日 AS 入社年月日,
            T1.退職年月日 AS 退職年月日,
            T1.休職年月日 AS 休職年月日,
            T1.復職年月日 AS 復職年月日,
            T1.税区分 AS 税区分,
            T2.通称氏名 AS 氏名,
            T2.通称氏名カナ AS 氏名カナ,
            T2.戸籍氏名 AS 戸籍氏名,
            T3.基本文字5_5 AS 雇用区分,
            T3.基本文字5_1 AS 職掌,
            T3.基本文字5_2 AS 職階,
            T3.入社年月日2 AS 入社年月日2,
            T3.共通文字1_4 AS 出向区分,
            T3.共通文字1_5 AS 海外出向区分,
            T4.所属名 AS 所属名称
        FROM
            給与明細マスタ項目1 T1
            LEFT JOIN (
                SELECT
                    会社コード,
                    社員番号,
                    給与支払年月
                FROM
                    給与明細マスタ項目1
                WHERE
                    会社コード = p_会社コード AND 給与支払年月 = p_給与支払年月_前月
            ) T5 ON T1.会社コード = T5.会社コード AND T1.社員番号 = T5.社員番号
            LEFT JOIN 給与明細マスタ項目3 T2 ON T1.会社コード = T2.会社コード
                               AND T1.給与支払年月 = T2.給与支払年月
                               AND T1.社員番号 = T2.社員番号
            LEFT JOIN 給与明細付録項目 T3 ON T1.会社コード = T3.会社コード
                             AND T1.給与支払年月 = T3.給与支払年月
                             AND T1.社員番号 = T3.社員番号
            LEFT JOIN 給与明細漢字データ項目 T4 ON T1.会社コード = T4.会社コード
                                AND T1.給与支払年月 = T4.給与支払年月
                                AND T1.社員番号 = T4.社員番号
        WHERE
            T5.会社コード IS NULL
            AND T5.社員番号 IS NULL
            AND T1.会社コード = p_会社コード
            AND T1.給与支払年月 = p_給与支払年月_当月
        UNION ALL
        SELECT
            '当月なし' AS 差異,
            T1.給与支払年月 AS 給与支払年月,
            T1.社員番号 AS 社員番号,
            ( T1.所属1
              || T1.所属2
              || T1.所属3
              || T1.所属4
              || T1.所属5 ) AS 所属コード,
            T1.氏名 AS 戸籍氏名カナ,
            T1.給与区分 AS 給与区分,
            T1.誕生生年月日 AS 生年月日,
            TRUNC((TO_CHAR(T1.給与支払年月)
                   || '01' - TO_CHAR(T1.誕生生年月日, 'YYYYMMDD')) / 10000, 0) AS 年齢,
            T1.入社年月日 AS 入社年月日,
            T1.退職年月日 AS 退職年月日,
            T1.休職年月日 AS 休職年月日,
            T1.復職年月日 AS 復職年月日,
            T1.税区分 AS 税区分,
            T2.通称氏名 AS 氏名,
            T2.通称氏名カナ AS 氏名カナ,
            T2.戸籍氏名 AS 戸籍氏名,
            T3.基本文字5_5 AS 雇用区分,
            T3.基本文字5_1 AS 職掌,
            T3.基本文字5_2 AS 職階,
            T3.入社年月日2 AS 入社年月日2,
            T3.共通文字1_4 AS 出向区分,
            T3.共通文字1_5 AS 海外出向区分,
            T4.所属名 AS 所属名称
        FROM
            給与明細マスタ項目1 T1
            LEFT JOIN (
                SELECT
                    会社コード,
                    社員番号,
                    給与支払年月
                FROM
                    給与明細マスタ項目1
                WHERE
                    会社コード = p_会社コード AND 給与支払年月 = p_給与支払年月_当月
            ) T5 ON T1.会社コード = T5.会社コード AND T1.社員番号 = T5.社員番号
            LEFT JOIN 給与明細マスタ項目3 T2 ON T1.会社コード = T2.会社コード
                               AND T1.給与支払年月 = T2.給与支払年月
                               AND T1.社員番号 = T2.社員番号
            LEFT JOIN 給与明細付録項目 T3 ON T1.会社コード = T3.会社コード
                             AND T1.給与支払年月 = T3.給与支払年月
                             AND T1.社員番号 = T3.社員番号
            LEFT JOIN 給与明細漢字データ項目 T4 ON T1.会社コード = T4.会社コード
                                AND T1.給与支払年月 = T4.給与支払年月
                                AND T1.社員番号 = T4.社員番号
        WHERE
            T5.会社コード IS NULL
            AND T5.社員番号 IS NULL
            AND T1.会社コード = p_会社コード
            AND T1.給与支払年月 = p_給与支払年月_前月;
            
    -- 社員情報レコード        
    給与明細マスタRec CUR給与明細マスタ%ROWTYPE;

    -- 給与明細変動項目取得
    CURSOR CUR給与明細変動項目(p_会社コード VARCHAR2, p_給与支払年月_当月 NUMBER, p_給与支払年月_前月 NUMBER) IS
        SELECT
            T1.社員番号,
            T1.親番変動コード,
            T1.枝番変動コード,
            T1.変動データ金額  変動データ金額,
            T2.変動データ金額  前_変動データ金額
        FROM
            給与明細変動項目   T1
        INNER JOIN 給与明細変動項目 T2 
        ON  T1.会社コード = T2.会社コード
            AND T1.社員番号 = T2.社員番号
            AND T1.親番変動コード = T2.親番変動コード
            AND T1.枝番変動コード = T2.枝番変動コード
            AND T1.会社コード = p_会社コード
            AND T1.給与支払年月 = P_給与支払年月_当月
            AND T2.給与支払年月 = P_給与支払年月_前月
            AND (
                (T1.親番変動コード = '848' AND T1.枝番変動コード IN ('001','010','016','018','025'))
                OR (T1.親番変動コード = '850' AND T1.枝番変動コード IN ('500','501','502','503','515','516','517','518'))
                OR (T1.親番変動コード = '853' AND T1.枝番変動コード BETWEEN '201' AND '224')
                OR (T1.親番変動コード = '855' AND T1.枝番変動コード BETWEEN '260' AND '285')
                OR (T1.親番変動コード = '856' AND T1.枝番変動コード BETWEEN '230' AND '254')
                OR (T1.親番変動コード = '857' AND T1.枝番変動コード BETWEEN '330' AND '332')
                )
        ORDER BY T1.親番変動コード,T1.枝番変動コード;

    /** 給与明細変動項目取得 **/
    FUNCTION 給与明細変動項目取得 (
        i_社員番号             IN    NUMBER,
        i_親番変動コード       IN    VARCHAR2,
        i_枝番変動コード       IN    VARCHAR2,
        o_変動データ金額       OUT   NUMBER,
        o_前_変動データ金額    OUT   NUMBER
    ) RETURN NUMBER IS
        給与明細変動項目Rec  CUR給与明細変動項目%ROWTYPE;
    BEGIN
        LOOP
            FETCH CUR給与明細変動項目 INTO 給与明細変動項目Rec;
            EXIT WHEN CUR給与明細変動項目%NOTFOUND;

            o_変動データ金額 := 0;
            o_前_変動データ金額 := 0;

            IF 給与明細変動項目Rec.社員番号 = i_社員番号 AND 給与明細変動項目Rec.親番変動コード = i_親番変動コード AND 給与明細変動項目Rec.枝番変動コード = i_枝番変動コード THEN
                o_変動データ金額 := 給与明細変動項目Rec.変動データ金額;
                o_前_変動データ金額 := 給与明細変動項目Rec.前_変動データ金額;

                EXIT;
            END IF;

        END LOOP;

        -- 正常を戻す
        RETURN(rtn正常);
    END;

    /** 変動データ金額取得 **/
    FUNCTION 変動データ金額取得 (
        i_会社コード           IN    VARCHAR2,
        i_給与支払年月_当月    IN    NUMBER,
        i_給与支払年月_前月    IN    NUMBER,
        i_社員番号             IN    NUMBER,
        i_親番変動コード       IN    VARCHAR2,
        i_枝番変動コード       IN    VARCHAR2,
        o_変動データ金額       OUT   NUMBER,
        o_前_変動データ金額    OUT   NUMBER
    ) RETURN NUMBER IS
    BEGIN
        BEGIN
            SELECT
                NVL(T1.変動データ金額, 0) 変動データ金額,
                NVL(T2.変動データ金額, 0) 前_変動データ金額
            INTO 
                o_変動データ金額,
                o_前_変動データ金額
            FROM
                給与明細変動項目 T1
                INNER JOIN 給与明細変動項目 T2
            ON T1.会社コード = T2.会社コード
                AND T1.社員番号 = T2.社員番号
                AND T1.親番変動コード = T2.親番変動コード
                AND T1.枝番変動コード = T2.枝番変動コード
                AND T1.会社コード = i_会社コード
                AND T1.社員番号 = i_社員番号
                AND T1.給与支払年月 = i_給与支払年月_当月
                AND T2.給与支払年月 = i_給与支払年月_前月
                AND T1.親番変動コード = i_親番変動コード
                AND T1.枝番変動コード = i_枝番変動コード;

            -- エラーが発生する時
            EXCEPTION
                WHEN OTHERS THEN
                    o_変動データ金額 := 0;
                    o_前_変動データ金額 := 0;
        END;

        -- 正常を戻す
        RETURN(rtn正常);
    END;

    /** 経理用給与明細親番項目取得 **/
    FUNCTION 経理用給与明細親番項目取得 (
        i_会社コード           IN       VARCHAR2,
        i_給与支払年月_当月    IN       NUMBER,
        i_給与支払年月_前月    IN       NUMBER,
        o_給与控除額           IN OUT   C0930前月当月給与控除額比較%ROWTYPE,
        oErrorMesg             OUT      VARCHAR2
    ) RETURN NUMBER IS
    -----------------------------------------------------------
    -- ★☆★  変数宣言部  ★☆★ --
    -----------------------------------------------------------
    n_変動データ金額       給与明細変動項目."親番変動コード"%TYPE;
    n_前_変動データ金額    給与明細変動項目."親番変動コード"%TYPE;
    n_健保料               経理用給与明細親番項目.健保料%TYPE;
    n_前_健保料            経理用給与明細親番項目.健保料%TYPE;
    
    BEGIN
        SELECT
            T1.生保A 生保A,
            T2.生保A 前_生保A,
            T1.その他保険 その他保険,
            T2.その他保険 前_その他保険,
            T1.福プロ会費 福プロ会費,
            T2.福プロ会費 前_福プロ会費,
            T1.組合費 組合費,
            T2.組合費 前_組合費,
            T1.貯蓄A 貯蓄A,
            T2.貯蓄A 前_貯蓄A,
            T1.貯蓄B 貯蓄B,
            T2.貯蓄B 前_貯蓄B,
            T1.社宅寮費 社宅寮費,
            T2.社宅寮費 前_社宅寮費,
            T1.その他A その他A,
            T2.その他A 前_その他A,
            T1.その他B その他B,
            T2.その他B 前_その他B,
            T1.その他C その他C,
            T2.その他C 前_その他C,
            T1.その他D その他D,
            T2.その他D 前_その他D,
            T1.その他E その他E,
            T2.その他E 前_その他E,
            T1.その他F その他F,
            T2.その他F 前_その他F,
            T1.その他G その他G,
            T2.その他G 前_その他G,
            T1.その他H その他H,
            T2.その他H 前_その他H,
            T1.その他I その他I,
            T2.その他I 前_その他I,
            T1.その他J その他J,
            T2.その他J 前_その他J,
            T1.その他K その他K,
            T2.その他K 前_その他K,
            T1.控除合計 控除合計,
            T2.控除合計 前_控除合計,
            T1.通勤手当課税分 通勤手当課税分,
            T2.通勤手当課税分 前_通勤手当課税分,
            T1.所得税対象額 所得税対象額,
            T2.所得税対象額 前_所得税対象額,
            T1.雇用保険対象額 雇用保険対象額,
            T2.雇用保険対象額 前_雇用保険対象額,
            T1.健保料 健保料,
            T2.健保料 前_健保料,
            T1.介護保険料 介護保険料,
            T2.介護保険料 前_介護保険料,
            T1.厚保料 厚保料,
            T2.厚保料 前_厚保料,
            T1.雇用保険料 雇用保険料,
            T2.雇用保険料 前_雇用保険料,
            T1.金額1 金額1,
            T2.金額1 前_金額1,
            T1.地方税 地方税,
            T2.地方税 前_地方税,
            T1.金額2 金額2,
            T2.金額2 前_金額2,
            NVL(T1.控除合計, 0) + NVL(T1.金額2, 0) 総控除額,
            NVL(T2.控除合計, 0) + NVL(T2.金額2, 0) 前_総控除額,
            T1.差し引き支給額 差し引き支給額,
            T2.差し引き支給額 前_差し引き支給額
        INTO
            o_給与控除額.生保a,
            o_給与控除額.前_生保a,
            o_給与控除額.その他保険,
            o_給与控除額.前_その他保険,
            o_給与控除額.福プロ会費,
            o_給与控除額.前_福プロ会費,
            o_給与控除額.組合費,
            o_給与控除額.前_組合費,
            o_給与控除額.貯蓄A,
            o_給与控除額.前_貯蓄A,
            o_給与控除額.貯蓄B,
            o_給与控除額.前_貯蓄B,
            o_給与控除額.社宅寮費,
            o_給与控除額.前_社宅寮費,
            o_給与控除額.その他A,
            o_給与控除額.前_その他A,
            o_給与控除額.その他B,
            o_給与控除額.前_その他B,
            o_給与控除額.その他C,
            o_給与控除額.前_その他C,
            o_給与控除額.その他D,
            o_給与控除額.前_その他D,
            o_給与控除額.その他E,
            o_給与控除額.前_その他E,
            o_給与控除額.その他F,
            o_給与控除額.前_その他F,
            o_給与控除額.その他G,
            o_給与控除額.前_その他G,
            o_給与控除額.その他H,
            o_給与控除額.前_その他H,
            o_給与控除額.その他I,
            o_給与控除額.前_その他I,
            o_給与控除額.その他J,
            o_給与控除額.前_その他J,
            o_給与控除額.その他K,
            o_給与控除額.前_その他K,
            o_給与控除額.非課税控除合計,
            o_給与控除額.前_非課税控除合計,
            o_給与控除額.通勤手当課税分,
            o_給与控除額.前_通勤手当課税分,
            o_給与控除額.所得税対象額,
            o_給与控除額.前_所得税対象額,
            o_給与控除額.雇用保険対象額,
            o_給与控除額.前_雇用保険対象額,
            n_健保料,
            n_前_健保料,
            o_給与控除額.介護保険料,
            o_給与控除額.前_介護保険料,
            o_給与控除額.厚保料,
            o_給与控除額.前_厚保料,
            o_給与控除額.雇保料,
            o_給与控除額.前_雇保料,
            o_給与控除額.所得税,
            o_給与控除額.前_所得税,
            o_給与控除額.地方税,
            o_給与控除額.前_地方税,
            o_給与控除額.法定控除合計,
            o_給与控除額.前_法定控除合計,
            o_給与控除額.総控除額,
            o_給与控除額.前_総控除額,
            o_給与控除額.差し引き支給額,
            o_給与控除額.前_差し引き支給額
        FROM
            経理用給与明細親番項目   T1
            INNER JOIN 経理用給与明細親番項目  T2 ON T1.会社コード = T2.会社コード
                                         AND T1.社員番号 = T2.社員番号
                                         AND T1.会社コード = i_会社コード
                                         AND T1.社員番号 = o_給与控除額.GUI
                                         AND T1.給与支払年月 = i_給与支払年月_当月
                                         AND T2.給与支払年月 = i_給与支払年月_前月;
        -- 変動データ金額取得
        rtn := 変動データ金額取得(i_会社コード, i_給与支払年月_当月, i_給与支払年月_前月, o_給与控除額.GUI, '857', '332', n_変動データ金額, n_前_変動データ金額);

        -- 健保料算出：編集要件  健保料 - 介護保険料
        o_給与控除額.健保料 := NVL(n_健保料, 0) - NVL(o_給与控除額.介護保険料, 0);
        o_給与控除額.前_健保料 := NVL(n_前_健保料, 0) - NVL(o_給与控除額.前_介護保険料, 0);
        -- 社会保険控除合計算出
        o_給与控除額.社会保険控除合計 := NVL(n_健保料, 0) + NVL(o_給与控除額.厚保料, 0) + NVL(o_給与控除額.雇保料, 0) + NVL(n_変動データ金額, 0);
        o_給与控除額.前_社会保険控除合計 := NVL(n_前_健保料, 0) + NVL(o_給与控除額.前_厚保料, 0) + NVL(o_給与控除額.前_雇保料, 0) + NVL(n_前_変動データ金額, 0);

        RETURN(rtn正常);

        -- エラーが発生する時
        EXCEPTION
            WHEN NO_DATA_FOUND THEN
                RETURN(rtnデータなし);
            WHEN OTHERS THEN
                -- 取得失敗時はエラーを返す
                oErrorMesg := '経理用給与明細親番項目取得_取得エラー:'
                           || '会社コード['
                           || i_会社コード
                           || ']'
                           || '給与支払年月_当月['
                           || i_給与支払年月_当月
                           || ']'
                           || '給与支払年月_前月['
                           || i_給与支払年月_前月
                           || ']'
                           || '社員番号['
                           || o_給与控除額.GUI
                           || ']'
                           || 'SQLCODE['
                           || SQLCODE
                           || ']'
                           || sqlerrm;

            RETURN(rtn異常);
    END;

    /** C0930経理仕訳個人詳細データ取得 **/
    FUNCTION C0930経理仕訳個人詳細データ取得 (
        i_会社コード           IN    VARCHAR2,
        i_給与支払年月_当月    IN    NUMBER,
        i_給与支払年月_前月    IN    NUMBER,
        i_社員番号             IN    NUMBER,
        i_経理集計区分         IN    VARCHAR2,
        i_変動コード           IN    VARCHAR2,
        o_税込み金額           OUT   NUMBER,
        o_前_税込み金額        OUT   NUMBER
    ) RETURN NUMBER IS
    BEGIN
        BEGIN
            SELECT
                SUM(NVL(T1.税込み金額, 0)) 税込み金額,
                SUM(NVL(T2.税込み金額, 0)) 前_税込み金額
            INTO 
                o_税込み金額,
                o_前_税込み金額
            FROM
                C0930経理仕訳個人詳細データ T1
                INNER JOIN C0930経理仕訳個人詳細データ T2
            ON T1.会社コード = T2.会社コード
                AND T1.ＧＵＩ = T2.ＧＵＩ
                AND T1.経理集計区分 = T2.経理集計区分
                AND T1.変動コード = T2.変動コード
                AND T1.会社コード = i_会社コード
                AND T1.ＧＵＩ = i_社員番号
                AND T1.給与支払年月 = i_給与支払年月_当月
                AND T2.給与支払年月 = i_給与支払年月_前月
                AND T1.経理集計区分 = i_経理集計区分
                AND T1.変動コード = i_変動コード;

            -- エラーが発生する時
            EXCEPTION
                WHEN OTHERS THEN
                    o_税込み金額 := 0;
                    o_前_税込み金額 := 0;
        END;

        -- 正常を戻す
        RETURN(rtn正常);
    END;

    /** 労災保険対象額取得 **/
    FUNCTION 労災保険対象額取得 (
        i_会社コード           IN    VARCHAR2,
        i_給与支払年月_当月    IN    NUMBER,
        i_給与支払年月_前月    IN    NUMBER,
        i_社員番号             IN    NUMBER,
        o_労災保険対象額       OUT   NUMBER,
        o_前_労災保険対象額    OUT   NUMBER,
        oErrorMesg             OUT   VARCHAR2
    ) RETURN NUMBER IS
    BEGIN
        SELECT
            T1.補助S数値11_4 労災保険対象額,
            T2.補助S数値11_4 前_労災保険対象額
        INTO 
            o_労災保険対象額,
            o_前_労災保険対象額
        FROM
            給与明細付録項目3 T1
            INNER JOIN 給与明細付録項目3 T2 
        ON  T1.会社コード = T2.会社コード
            AND T1.社員番号 = T2.社員番号
            AND T1.会社コード = i_会社コード
            AND T1.社員番号 = i_社員番号
            AND T1.給与支払年月 = i_給与支払年月_当月
            AND T2.給与支払年月 = i_給与支払年月_前月;

        RETURN(rtn正常);

        -- エラーが発生する時
        EXCEPTION
            WHEN NO_DATA_FOUND THEN
                RETURN(rtnデータなし);
            WHEN OTHERS THEN
                -- 取得失敗時はエラーを返す
                oErrorMesg := '労災保険対象額取得_取得エラー:'
                           || '会社コード['
                           || i_会社コード
                           || ']'
                           || '給与支払年月_当月['
                           || i_給与支払年月_当月
                           || ']'
                           || '給与支払年月_前月['
                           || i_給与支払年月_前月
                           || ']'
                           || '社員番号['
                           || i_社員番号
                           || ']'
                           || 'SQLCODE['
                           || SQLCODE
                           || ']'
                           || sqlerrm;

            RETURN(rtn異常);
    END;

    /** 2つNUMBER型の値を比較する **/
    FUNCTION 数値比較 (
        i_差異    IN    VARCHAR2,
        i_当月値  IN    NUMBER,
        i_前月値  IN    NUMBER,
        o_差額    OUT   NUMBER
    ) RETURN VARCHAR2 IS
    BEGIN
        -- 検索結果チェック
        IF ( NVL(i_当月値, 0) = NVL(i_前月値, 0) ) THEN
            RETURN i_差異;
        ELSE
            o_差額 := NVL(i_当月値, 0) - NVL(i_前月値, 0);
            IF i_差異 IS NULL THEN
                RETURN 差異_あり;
            ELSE
                RETURN i_差異;
            END IF;
        END IF;
    END;

BEGIN
    -- 初期化
    o_処理件数 := 0;
    o_正常件数 := 0;
    o_異常件数 := 0;
    oErrorMesg := '';

    --エラー内容クリア
    KP930当月前月比較PKG.clearError(i_プログラムID, i_会社コード);

    -- 引数チェック
    IF i_会社コード IS NULL OR i_給与支払年月_当月 IS NULL OR i_給与支払年月_前月 IS NULL OR i_プログラムID IS NULL OR i_担当者コード IS NULL THEN
        oErrorMesg := '引数エラーが発生しました。';
        RAISE 致命エラー;
    END IF;

    /** テーブル「C0930前月当月給与控除額比較」のデータ削除 **/
    BEGIN
        DELETE
        FROM    C0930前月当月給与控除額比較
        WHERE   会社コード    = i_会社コード
        AND     給与支払年月  = i_給与支払年月_当月
        ;
        -- コミット
        COMMIT;
    EXCEPTION
        WHEN OTHERS THEN
            oErrorMesg := '「C0930前月当月給与控除額比較」のデータの削除に失敗しました。'
                       || '会社コード['
                       || i_会社コード
                       || ']'
                       || '給与支払年月['
                       || i_給与支払年月_当月
                       || ']'
                       || 'SQLERRM['
                       || SQLERRM(SQLCODE)
                       || ']';

            RAISE 致命エラー;
    END;

    OPEN CUR給与明細変動項目(i_会社コード, i_給与支払年月_当月, i_給与支払年月_前月);

    OPEN CUR給与明細マスタ(i_会社コード, i_給与支払年月_当月, i_給与支払年月_前月);
    LOOP
        FETCH CUR給与明細マスタ into 給与明細マスタRec;
        EXIT WHEN CUR給与明細マスタ%NOTFOUND;

        -- 総処理件数加算
        o_処理件数 := o_処理件数 + 1;

        差異 := 給与明細マスタRec.差異;

        給与控除額Rec := NULL;

        給与控除額Rec.GUI := 給与明細マスタRec.社員番号;
        給与控除額Rec.所属コード := 給与明細マスタRec.所属コード;
        給与控除額Rec.所属名称 := 給与明細マスタRec.所属名称;
        給与控除額Rec.氏名 := 給与明細マスタRec.氏名;
        給与控除額Rec.氏名カナ := 給与明細マスタRec.氏名カナ;
        給与控除額Rec.戸籍氏名 := 給与明細マスタRec.戸籍氏名;
        給与控除額Rec.戸籍氏名カナ := 給与明細マスタRec.戸籍氏名カナ;
        給与控除額Rec.給与区分 := 給与明細マスタRec.給与区分;
        給与控除額Rec.雇用区分 := 給与明細マスタRec.雇用区分;
        給与控除額Rec.職掌 := 給与明細マスタRec.職掌;
        給与控除額Rec.職階 := 給与明細マスタRec.職階;
        給与控除額Rec.生年月日 := 給与明細マスタRec.生年月日;
        給与控除額Rec.年齢 := 給与明細マスタRec.年齢;
        給与控除額Rec.入社年月日 := 給与明細マスタRec.入社年月日;
        給与控除額Rec.入社年月日2 := 給与明細マスタRec.入社年月日2;
        給与控除額Rec.退職年月日 := 給与明細マスタRec.退職年月日;
        給与控除額Rec.休職年月日 := 給与明細マスタRec.休職年月日;
        給与控除額Rec.復職年月日 := 給与明細マスタRec.復職年月日;
        給与控除額Rec.出向区分 := 給与明細マスタRec.出向区分;
        給与控除額Rec.海外出向区分 := 給与明細マスタRec.海外出向区分;
        給与控除額Rec.税区分 := 給与明細マスタRec.税区分;

        -- 経理用給与明細親番項目取得
        rtn := 経理用給与明細親番項目取得(i_会社コード, i_給与支払年月_当月, i_給与支払年月_前月, 給与控除額Rec, oErrorMesg);
        IF rtn = rtn異常 THEN
            -- エラー情報登録
            KP930当月前月比較PKG.PUTERROR(
                                    i_プログラムid, 
                                    i_会社コード, 
                                    i_給与支払年月_当月, 
                                    i_給与支払年月_前月, 
                                    i_担当者コード, 
                                    給与控除額Rec.GUI, 
                                    oErrorMesg, 
                                    '');

            o_異常件数 := o_異常件数 + 1;
            CONTINUE;
        ELSE
            差異 := 数値比較(差異, 給与控除額Rec.生保A, 給与控除額Rec.前_生保A, 給与控除額Rec.差_生保A);
            差異 := 数値比較(差異, 給与控除額Rec.その他保険, 給与控除額Rec.前_その他保険, 給与控除額Rec.差_その他保険);
            差異 := 数値比較(差異, 給与控除額Rec.福プロ会費, 給与控除額Rec.前_福プロ会費, 給与控除額Rec.差_福プロ会費);
            差異 := 数値比較(差異, 給与控除額Rec.組合費, 給与控除額Rec.前_組合費, 給与控除額Rec.差_組合費);
            差異 := 数値比較(差異, 給与控除額Rec.貯蓄A, 給与控除額Rec.前_貯蓄A, 給与控除額Rec.差_貯蓄A);
            差異 := 数値比較(差異, 給与控除額Rec.貯蓄B, 給与控除額Rec.前_貯蓄B, 給与控除額Rec.差_貯蓄B);
            差異 := 数値比較(差異, 給与控除額Rec.社宅寮費, 給与控除額Rec.前_社宅寮費, 給与控除額Rec.差_社宅寮費);
            差異 := 数値比較(差異, 給与控除額Rec.その他A, 給与控除額Rec.前_その他A, 給与控除額Rec.差_その他A);
            差異 := 数値比較(差異, 給与控除額Rec.その他B, 給与控除額Rec.前_その他B, 給与控除額Rec.差_その他B);
            差異 := 数値比較(差異, 給与控除額Rec.その他C, 給与控除額Rec.前_その他C, 給与控除額Rec.差_その他C);
            差異 := 数値比較(差異, 給与控除額Rec.その他D, 給与控除額Rec.前_その他D, 給与控除額Rec.差_その他D);
            差異 := 数値比較(差異, 給与控除額Rec.その他E, 給与控除額Rec.前_その他E, 給与控除額Rec.差_その他E);
            差異 := 数値比較(差異, 給与控除額Rec.その他F, 給与控除額Rec.前_その他F, 給与控除額Rec.差_その他F);
            差異 := 数値比較(差異, 給与控除額Rec.その他G, 給与控除額Rec.前_その他G, 給与控除額Rec.差_その他G);
            差異 := 数値比較(差異, 給与控除額Rec.その他H, 給与控除額Rec.前_その他H, 給与控除額Rec.差_その他H);
            差異 := 数値比較(差異, 給与控除額Rec.その他I, 給与控除額Rec.前_その他I, 給与控除額Rec.差_その他I);
            差異 := 数値比較(差異, 給与控除額Rec.その他J, 給与控除額Rec.前_その他J, 給与控除額Rec.差_その他J);
            差異 := 数値比較(差異, 給与控除額Rec.その他K, 給与控除額Rec.前_その他K, 給与控除額Rec.差_その他K);
            差異 := 数値比較(差異, 給与控除額Rec.非課税控除合計, 給与控除額Rec.前_非課税控除合計, 給与控除額Rec.差_非課税控除合計);
            差異 := 数値比較(差異, 給与控除額Rec.通勤手当課税分, 給与控除額Rec.前_通勤手当課税分, 給与控除額Rec.差_通勤手当課税分);
            差異 := 数値比較(差異, 給与控除額Rec.所得税対象額, 給与控除額Rec.前_所得税対象額, 給与控除額Rec.差_所得税対象額);
            差異 := 数値比較(差異, 給与控除額Rec.雇用保険対象額, 給与控除額Rec.前_雇用保険対象額, 給与控除額Rec.差_雇用保険対象額);
            差異 := 数値比較(差異, 給与控除額Rec.健保料, 給与控除額Rec.前_健保料, 給与控除額Rec.差_健保料);
            差異 := 数値比較(差異, 給与控除額Rec.介護保険料, 給与控除額Rec.前_介護保険料, 給与控除額Rec.差_介護保険料);
            差異 := 数値比較(差異, 給与控除額Rec.厚保料, 給与控除額Rec.前_厚保料, 給与控除額Rec.差_厚保料);
            差異 := 数値比較(差異, 給与控除額Rec.雇保料, 給与控除額Rec.前_雇保料, 給与控除額Rec.差_雇保料);
            差異 := 数値比較(差異, 給与控除額Rec.所得税, 給与控除額Rec.前_所得税, 給与控除額Rec.差_所得税);
            差異 := 数値比較(差異, 給与控除額Rec.地方税, 給与控除額Rec.前_地方税, 給与控除額Rec.差_地方税);
            差異 := 数値比較(差異, 給与控除額Rec.社会保険控除合計, 給与控除額Rec.前_社会保険控除合計, 給与控除額Rec.差_社会保険控除合計);
            差異 := 数値比較(差異, 給与控除額Rec.法定控除合計, 給与控除額Rec.前_法定控除合計, 給与控除額Rec.差_法定控除合計);
            差異 := 数値比較(差異, 給与控除額Rec.総控除額, 給与控除額Rec.前_総控除額, 給与控除額Rec.差_総控除額);
            差異 := 数値比較(差異, 給与控除額Rec.差し引き支給額, 給与控除額Rec.前_差し引き支給額, 給与控除額Rec.差_差し引き支給額);
        END IF;
        
        rtn := 労災保険対象額取得(i_会社コード, i_給与支払年月_当月, i_給与支払年月_前月, 給与控除額Rec.GUI, 給与控除額Rec.補助S数値11_4, 給与控除額Rec.前_補助S数値11_4, oErrorMesg);
        IF rtn = rtn異常 THEN
            -- エラー情報登録
            KP930当月前月比較PKG.PUTERROR(
                                    i_プログラムid, 
                                    i_会社コード, 
                                    i_給与支払年月_当月, 
                                    i_給与支払年月_前月, 
                                    i_担当者コード, 
                                    給与控除額Rec.GUI, 
                                    oErrorMesg, 
                                    '');

            o_異常件数 := o_異常件数 + 1;
            CONTINUE;
        ELSE
            差異 := 数値比較(差異, 給与控除額Rec.補助S数値11_4, 給与控除額Rec.前_補助S数値11_4, 給与控除額Rec.差_補助S数値11_4);
        END IF;

        -- 給与明細変動項目取得
        rtn := 給与明細変動項目取得(給与控除額Rec.GUI, '848', '001', 給与控除額Rec.変動001, 給与控除額Rec.前_変動001);
        差異 := 数値比較(差異, 給与控除額rec.変動001, 給与控除額rec.前_変動001, 給与控除額rec.差_変動001);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '848', '010', 給与控除額rec.変動010, 給与控除額rec.前_変動010);
        差異 := 数値比較(差異, 給与控除額rec.変動010, 給与控除額rec.前_変動010, 給与控除額rec.差_変動010);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '848', '016', 給与控除額rec.変動016, 給与控除額rec.前_変動016);
        差異 := 数値比較(差異, 給与控除額rec.変動016, 給与控除額rec.前_変動016, 給与控除額rec.差_変動016);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '848', '018', 給与控除額rec.変動018, 給与控除額rec.前_変動018);
        差異 := 数値比較(差異, 給与控除額rec.変動018, 給与控除額rec.前_変動018, 給与控除額rec.差_変動018);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '848', '025', 給与控除額rec.変動025, 給与控除額rec.前_変動025);
        差異 := 数値比較(差異, 給与控除額rec.変動025, 給与控除額rec.前_変動025, 給与控除額rec.差_変動025);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '850', '500', 給与控除額rec.変動500, 給与控除額rec.前_変動500);
        差異 := 数値比較(差異, 給与控除額rec.変動500, 給与控除額rec.前_変動500, 給与控除額rec.差_変動500);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '850', '501', 給与控除額rec.変動501, 給与控除額rec.前_変動501);
        差異 := 数値比較(差異, 給与控除額rec.変動501, 給与控除額rec.前_変動501, 給与控除額rec.差_変動501);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '850', '502', 給与控除額rec.変動502, 給与控除額rec.前_変動502);
        差異 := 数値比較(差異, 給与控除額rec.変動502, 給与控除額rec.前_変動502, 給与控除額rec.差_変動502);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '850', '503', 給与控除額rec.変動503, 給与控除額rec.前_変動503);
        差異 := 数値比較(差異, 給与控除額rec.変動503, 給与控除額rec.前_変動503, 給与控除額rec.差_変動503);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '850', '515', 給与控除額rec.変動515, 給与控除額rec.前_変動515);
        差異 := 数値比較(差異, 給与控除額rec.変動515, 給与控除額rec.前_変動515, 給与控除額rec.差_変動515);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '850', '516', 給与控除額rec.変動516, 給与控除額rec.前_変動516);
        差異 := 数値比較(差異, 給与控除額rec.変動516, 給与控除額rec.前_変動516, 給与控除額rec.差_変動516);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '850', '517', 給与控除額rec.変動517, 給与控除額rec.前_変動517);
        差異 := 数値比較(差異, 給与控除額rec.変動517, 給与控除額rec.前_変動517, 給与控除額rec.差_変動517);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '850', '518', 給与控除額rec.変動518, 給与控除額rec.前_変動518);
        差異 := 数値比較(差異, 給与控除額rec.変動518, 給与控除額rec.前_変動518, 給与控除額rec.差_変動518);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '853', '200', 給与控除額rec.変動200, 給与控除額rec.前_変動200);
        差異 := 数値比較(差異, 給与控除額rec.変動200, 給与控除額rec.前_変動200, 給与控除額rec.差_変動200);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '853', '201', 給与控除額rec.変動201, 給与控除額rec.前_変動201);
        差異 := 数値比較(差異, 給与控除額rec.変動201, 給与控除額rec.前_変動201, 給与控除額rec.差_変動201);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '853', '202', 給与控除額rec.変動202, 給与控除額rec.前_変動202);
        差異 := 数値比較(差異, 給与控除額rec.変動202, 給与控除額rec.前_変動202, 給与控除額rec.差_変動202);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '853', '203', 給与控除額rec.変動203, 給与控除額rec.前_変動203);
        差異 := 数値比較(差異, 給与控除額rec.変動203, 給与控除額rec.前_変動203, 給与控除額rec.差_変動203);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '853', '204', 給与控除額rec.変動204, 給与控除額rec.前_変動204);
        差異 := 数値比較(差異, 給与控除額rec.変動204, 給与控除額rec.前_変動204, 給与控除額rec.差_変動204);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '853', '205', 給与控除額rec.変動205, 給与控除額rec.前_変動205);
        差異 := 数値比較(差異, 給与控除額rec.変動205, 給与控除額rec.前_変動205, 給与控除額rec.差_変動205);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '853', '206', 給与控除額rec.変動206, 給与控除額rec.前_変動206);
        差異 := 数値比較(差異, 給与控除額rec.変動206, 給与控除額rec.前_変動206, 給与控除額rec.差_変動206);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '853', '207', 給与控除額rec.変動207, 給与控除額rec.前_変動207);
        差異 := 数値比較(差異, 給与控除額rec.変動207, 給与控除額rec.前_変動207, 給与控除額rec.差_変動207);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '853', '208', 給与控除額rec.変動208, 給与控除額rec.前_変動208);
        差異 := 数値比較(差異, 給与控除額rec.変動208, 給与控除額rec.前_変動208, 給与控除額rec.差_変動208);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '853', '209', 給与控除額rec.変動209, 給与控除額rec.前_変動209);
        差異 := 数値比較(差異, 給与控除額rec.変動209, 給与控除額rec.前_変動209, 給与控除額rec.差_変動209);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '853', '210', 給与控除額rec.変動210, 給与控除額rec.前_変動210);
        差異 := 数値比較(差異, 給与控除額rec.変動210, 給与控除額rec.前_変動210, 給与控除額rec.差_変動210);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '853', '211', 給与控除額rec.変動211, 給与控除額rec.前_変動211);
        差異 := 数値比較(差異, 給与控除額rec.変動211, 給与控除額rec.前_変動211, 給与控除額rec.差_変動211);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '853', '212', 給与控除額rec.変動212, 給与控除額rec.前_変動212);
        差異 := 数値比較(差異, 給与控除額rec.変動212, 給与控除額rec.前_変動212, 給与控除額rec.差_変動212);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '853', '213', 給与控除額rec.変動213, 給与控除額rec.前_変動213);
        差異 := 数値比較(差異, 給与控除額rec.変動213, 給与控除額rec.前_変動213, 給与控除額rec.差_変動213);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '853', '214', 給与控除額rec.変動214, 給与控除額rec.前_変動214);
        差異 := 数値比較(差異, 給与控除額rec.変動214, 給与控除額rec.前_変動214, 給与控除額rec.差_変動214);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '853', '215', 給与控除額rec.変動215, 給与控除額rec.前_変動215);
        差異 := 数値比較(差異, 給与控除額rec.変動215, 給与控除額rec.前_変動215, 給与控除額rec.差_変動215);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '853', '216', 給与控除額rec.変動216, 給与控除額rec.前_変動216);
        差異 := 数値比較(差異, 給与控除額rec.変動216, 給与控除額rec.前_変動216, 給与控除額rec.差_変動216);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '853', '217', 給与控除額rec.変動217, 給与控除額rec.前_変動217);
        差異 := 数値比較(差異, 給与控除額rec.変動217, 給与控除額rec.前_変動217, 給与控除額rec.差_変動217);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '853', '223', 給与控除額rec.変動223, 給与控除額rec.前_変動223);
        差異 := 数値比較(差異, 給与控除額rec.変動223, 給与控除額rec.前_変動223, 給与控除額rec.差_変動223);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '853', '224', 給与控除額rec.変動224, 給与控除額rec.前_変動224);
        差異 := 数値比較(差異, 給与控除額rec.変動224, 給与控除額rec.前_変動224, 給与控除額rec.差_変動224);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '855', '260', 給与控除額rec.変動260, 給与控除額rec.前_変動260);
        差異 := 数値比較(差異, 給与控除額rec.変動260, 給与控除額rec.前_変動260, 給与控除額rec.差_変動260);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '855', '261', 給与控除額rec.変動261, 給与控除額rec.前_変動261);
        差異 := 数値比較(差異, 給与控除額rec.変動261, 給与控除額rec.前_変動261, 給与控除額rec.差_変動261);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '855', '262', 給与控除額rec.変動262, 給与控除額rec.前_変動262);
        差異 := 数値比較(差異, 給与控除額rec.変動262, 給与控除額rec.前_変動262, 給与控除額rec.差_変動262);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '855', '263', 給与控除額rec.変動263, 給与控除額rec.前_変動263);
        差異 := 数値比較(差異, 給与控除額rec.変動263, 給与控除額rec.前_変動263, 給与控除額rec.差_変動263);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '855', '264', 給与控除額rec.変動264, 給与控除額rec.前_変動264);
        差異 := 数値比較(差異, 給与控除額rec.変動264, 給与控除額rec.前_変動264, 給与控除額rec.差_変動264);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '855', '265', 給与控除額rec.変動265, 給与控除額rec.前_変動265);
        差異 := 数値比較(差異, 給与控除額rec.変動265, 給与控除額rec.前_変動265, 給与控除額rec.差_変動265);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '855', '266', 給与控除額rec.変動266, 給与控除額rec.前_変動266);
        差異 := 数値比較(差異, 給与控除額rec.変動266, 給与控除額rec.前_変動266, 給与控除額rec.差_変動266);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '855', '267', 給与控除額rec.変動267, 給与控除額rec.前_変動267);
        差異 := 数値比較(差異, 給与控除額rec.変動267, 給与控除額rec.前_変動267, 給与控除額rec.差_変動267);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '855', '268', 給与控除額rec.変動268, 給与控除額rec.前_変動268);
        差異 := 数値比較(差異, 給与控除額rec.変動268, 給与控除額rec.前_変動268, 給与控除額rec.差_変動268);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '855', '269', 給与控除額rec.変動269, 給与控除額rec.前_変動269);
        差異 := 数値比較(差異, 給与控除額rec.変動269, 給与控除額rec.前_変動269, 給与控除額rec.差_変動269);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '855', '270', 給与控除額rec.変動270, 給与控除額rec.前_変動270);
        差異 := 数値比較(差異, 給与控除額rec.変動270, 給与控除額rec.前_変動270, 給与控除額rec.差_変動270);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '855', '271', 給与控除額rec.変動271, 給与控除額rec.前_変動271);
        差異 := 数値比較(差異, 給与控除額rec.変動271, 給与控除額rec.前_変動271, 給与控除額rec.差_変動271);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '855', '272', 給与控除額rec.変動272, 給与控除額rec.前_変動272);
        差異 := 数値比較(差異, 給与控除額rec.変動272, 給与控除額rec.前_変動272, 給与控除額rec.差_変動272);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '855', '273', 給与控除額rec.変動273, 給与控除額rec.前_変動273);
        差異 := 数値比較(差異, 給与控除額rec.変動273, 給与控除額rec.前_変動273, 給与控除額rec.差_変動273);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '855', '274', 給与控除額rec.変動274, 給与控除額rec.前_変動274);
        差異 := 数値比較(差異, 給与控除額rec.変動274, 給与控除額rec.前_変動274, 給与控除額rec.差_変動274);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '855', '275', 給与控除額rec.変動275, 給与控除額rec.前_変動275);
        差異 := 数値比較(差異, 給与控除額rec.変動275, 給与控除額rec.前_変動275, 給与控除額rec.差_変動275);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '855', '276', 給与控除額rec.変動276, 給与控除額rec.前_変動276);
        差異 := 数値比較(差異, 給与控除額rec.変動276, 給与控除額rec.前_変動276, 給与控除額rec.差_変動276);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '855', '277', 給与控除額rec.変動277, 給与控除額rec.前_変動277);
        差異 := 数値比較(差異, 給与控除額rec.変動277, 給与控除額rec.前_変動277, 給与控除額rec.差_変動277);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '855', '278', 給与控除額rec.変動278, 給与控除額rec.前_変動278);
        差異 := 数値比較(差異, 給与控除額rec.変動278, 給与控除額rec.前_変動278, 給与控除額rec.差_変動278);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '855', '279', 給与控除額rec.変動279, 給与控除額rec.前_変動279);
        差異 := 数値比較(差異, 給与控除額rec.変動279, 給与控除額rec.前_変動279, 給与控除額rec.差_変動279);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '855', '280', 給与控除額rec.変動280, 給与控除額rec.前_変動280);
        差異 := 数値比較(差異, 給与控除額rec.変動280, 給与控除額rec.前_変動280, 給与控除額rec.差_変動280);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '855', '282', 給与控除額rec.変動282, 給与控除額rec.前_変動282);
        差異 := 数値比較(差異, 給与控除額rec.変動282, 給与控除額rec.前_変動282, 給与控除額rec.差_変動282);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '855', '283', 給与控除額rec.変動283, 給与控除額rec.前_変動283);
        差異 := 数値比較(差異, 給与控除額rec.変動283, 給与控除額rec.前_変動283, 給与控除額rec.差_変動283);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '855', '284', 給与控除額rec.変動284, 給与控除額rec.前_変動284);
        差異 := 数値比較(差異, 給与控除額rec.変動284, 給与控除額rec.前_変動284, 給与控除額rec.差_変動284);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '855', '285', 給与控除額rec.変動285, 給与控除額rec.前_変動285);
        差異 := 数値比較(差異, 給与控除額rec.変動285, 給与控除額rec.前_変動285, 給与控除額rec.差_変動285);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '856', '230', 給与控除額rec.変動230, 給与控除額rec.前_変動230);
        差異 := 数値比較(差異, 給与控除額rec.変動230, 給与控除額rec.前_変動230, 給与控除額rec.差_変動230);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '856', '231', 給与控除額rec.変動231, 給与控除額rec.前_変動231);
        差異 := 数値比較(差異, 給与控除額rec.変動231, 給与控除額rec.前_変動231, 給与控除額rec.差_変動231);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '856', '232', 給与控除額rec.変動232, 給与控除額rec.前_変動232);
        差異 := 数値比較(差異, 給与控除額rec.変動232, 給与控除額rec.前_変動232, 給与控除額rec.差_変動232);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '856', '233', 給与控除額rec.変動233, 給与控除額rec.前_変動233);
        差異 := 数値比較(差異, 給与控除額rec.変動233, 給与控除額rec.前_変動233, 給与控除額rec.差_変動233);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '856', '234', 給与控除額rec.変動234, 給与控除額rec.前_変動234);
        差異 := 数値比較(差異, 給与控除額rec.変動234, 給与控除額rec.前_変動234, 給与控除額rec.差_変動234);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '856', '235', 給与控除額rec.変動235, 給与控除額rec.前_変動235);
        差異 := 数値比較(差異, 給与控除額rec.変動235, 給与控除額rec.前_変動235, 給与控除額rec.差_変動235);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '856', '236', 給与控除額rec.変動236, 給与控除額rec.前_変動236);
        差異 := 数値比較(差異, 給与控除額rec.変動236, 給与控除額rec.前_変動236, 給与控除額rec.差_変動236);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '856', '237', 給与控除額rec.変動237, 給与控除額rec.前_変動237);
        差異 := 数値比較(差異, 給与控除額rec.変動237, 給与控除額rec.前_変動237, 給与控除額rec.差_変動237);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '856', '238', 給与控除額rec.変動238, 給与控除額rec.前_変動238);
        差異 := 数値比較(差異, 給与控除額rec.変動238, 給与控除額rec.前_変動238, 給与控除額rec.差_変動238);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '856', '239', 給与控除額rec.変動239, 給与控除額rec.前_変動239);
        差異 := 数値比較(差異, 給与控除額rec.変動239, 給与控除額rec.前_変動239, 給与控除額rec.差_変動239);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '856', '240', 給与控除額rec.変動240, 給与控除額rec.前_変動240);
        差異 := 数値比較(差異, 給与控除額rec.変動240, 給与控除額rec.前_変動240, 給与控除額rec.差_変動240);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '856', '241', 給与控除額rec.変動241, 給与控除額rec.前_変動241);
        差異 := 数値比較(差異, 給与控除額rec.変動241, 給与控除額rec.前_変動241, 給与控除額rec.差_変動241);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '856', '242', 給与控除額rec.変動242, 給与控除額rec.前_変動242);
        差異 := 数値比較(差異, 給与控除額rec.変動242, 給与控除額rec.前_変動242, 給与控除額rec.差_変動242);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '856', '243', 給与控除額rec.変動243, 給与控除額rec.前_変動243);
        差異 := 数値比較(差異, 給与控除額rec.変動243, 給与控除額rec.前_変動243, 給与控除額rec.差_変動243);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '856', '244', 給与控除額rec.変動244, 給与控除額rec.前_変動244);
        差異 := 数値比較(差異, 給与控除額rec.変動244, 給与控除額rec.前_変動244, 給与控除額rec.差_変動244);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '856', '245', 給与控除額rec.変動245, 給与控除額rec.前_変動245);
        差異 := 数値比較(差異, 給与控除額rec.変動245, 給与控除額rec.前_変動245, 給与控除額rec.差_変動245);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '856', '246', 給与控除額rec.変動246, 給与控除額rec.前_変動246);
        差異 := 数値比較(差異, 給与控除額rec.変動246, 給与控除額rec.前_変動246, 給与控除額rec.差_変動246);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '856', '247', 給与控除額rec.変動247, 給与控除額rec.前_変動247);
        差異 := 数値比較(差異, 給与控除額rec.変動247, 給与控除額rec.前_変動247, 給与控除額rec.差_変動247);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '856', '248', 給与控除額rec.変動248, 給与控除額rec.前_変動248);
        差異 := 数値比較(差異, 給与控除額rec.変動248, 給与控除額rec.前_変動248, 給与控除額rec.差_変動248);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '856', '249', 給与控除額rec.変動249, 給与控除額rec.前_変動249);
        差異 := 数値比較(差異, 給与控除額rec.変動249, 給与控除額rec.前_変動249, 給与控除額rec.差_変動249);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '856', '250', 給与控除額rec.変動250, 給与控除額rec.前_変動250);
        差異 := 数値比較(差異, 給与控除額rec.変動250, 給与控除額rec.前_変動250, 給与控除額rec.差_変動250);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '856', '251', 給与控除額rec.変動251, 給与控除額rec.前_変動251);
        差異 := 数値比較(差異, 給与控除額rec.変動251, 給与控除額rec.前_変動251, 給与控除額rec.差_変動251);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '856', '252', 給与控除額rec.変動252, 給与控除額rec.前_変動252);
        差異 := 数値比較(差異, 給与控除額rec.変動252, 給与控除額rec.前_変動252, 給与控除額rec.差_変動252);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '856', '253', 給与控除額rec.変動253, 給与控除額rec.前_変動253);
        差異 := 数値比較(差異, 給与控除額rec.変動253, 給与控除額rec.前_変動253, 給与控除額rec.差_変動253);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '856', '254', 給与控除額rec.変動254, 給与控除額rec.前_変動254);
        差異 := 数値比較(差異, 給与控除額rec.変動254, 給与控除額rec.前_変動254, 給与控除額rec.差_変動254);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '857', '330', 給与控除額rec.変動330, 給与控除額rec.前_変動330);
        差異 := 数値比較(差異, 給与控除額rec.変動330, 給与控除額rec.前_変動330, 給与控除額rec.差_変動330);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '857', '331', 給与控除額rec.変動331, 給与控除額rec.前_変動331);
        差異 := 数値比較(差異, 給与控除額rec.変動331, 給与控除額rec.前_変動331, 給与控除額rec.差_変動331);

        rtn := 給与明細変動項目取得(給与控除額rec.gui, '857', '332', 給与控除額rec.変動332, 給与控除額rec.前_変動332);
        差異 := 数値比較(差異, 給与控除額rec.変動332, 給与控除額rec.前_変動332, 給与控除額rec.差_変動332); 

        -- C0930経理仕訳個人詳細データ取得
        rtn := C0930経理仕訳個人詳細データ取得(i_会社コード, i_給与支払年月_当月, i_給与支払年月_前月, 給与控除額Rec.GUI, '100', 'X07', 給与控除額Rec.健康保険料_会社_給与, 給与控除額Rec.前_健康保険料_会社_給与);
        差異 := 数値比較(差異, 給与控除額Rec.健康保険料_会社_給与, 給与控除額Rec.前_健康保険料_会社_給与, 給与控除額Rec.差_健康保険料_会社_給与);

        rtn := C0930経理仕訳個人詳細データ取得(i_会社コード, i_給与支払年月_当月, i_給与支払年月_前月, 給与控除額Rec.GUI, '100', 'X08', 給与控除額Rec.介護保険料_会社_給与, 給与控除額Rec.前_介護保険料_会社_給与);
        差異 := 数値比較(差異, 給与控除額Rec.介護保険料_会社_給与, 給与控除額Rec.前_介護保険料_会社_給与, 給与控除額Rec.差_介護保険料_会社_給与);

        rtn := C0930経理仕訳個人詳細データ取得(i_会社コード, i_給与支払年月_当月, i_給与支払年月_前月, 給与控除額Rec.GUI, '100', 'X09', 給与控除額Rec.厚生年金保険料_会社_給与, 給与控除額Rec.前_厚生年金保険料_会社_給与);
        差異 := 数値比較(差異, 給与控除額Rec.厚生年金保険料_会社_給与, 給与控除額Rec.前_厚生年金保険料_会社_給与, 給与控除額Rec.差_厚生年金保険料_会社_給与);

        rtn := C0930経理仕訳個人詳細データ取得(i_会社コード, i_給与支払年月_当月, i_給与支払年月_前月, 給与控除額Rec.GUI, '100', 'X10', 給与控除額Rec.企業年金基金保険料_給与, 給与控除額Rec.前_企業年金基金保険料_給与);
        差異 := 数値比較(差異, 給与控除額Rec.企業年金基金保険料_給与, 給与控除額Rec.前_企業年金基金保険料_給与, 給与控除額Rec.差_企業年金基金保険料_給与);

        rtn := C0930経理仕訳個人詳細データ取得(i_会社コード, i_給与支払年月_当月, i_給与支払年月_前月, 給与控除額Rec.GUI, '100', 'X11', 給与控除額Rec.子ども子育て拠出金_給与, 給与控除額Rec.前_子ども子育て拠出金_給与);
        差異 := 数値比較(差異, 給与控除額Rec.子ども子育て拠出金_給与, 給与控除額Rec.前_子ども子育て拠出金_給与, 給与控除額Rec.差_子ども子育て拠出金_給与);

        rtn := C0930経理仕訳個人詳細データ取得(i_会社コード, i_給与支払年月_当月, i_給与支払年月_前月, 給与控除額Rec.GUI, '100', 'X12', 給与控除額Rec.健康保険料_会社_退職, 給与控除額Rec.前_健康保険料_会社_退職);
        差異 := 数値比較(差異, 給与控除額Rec.健康保険料_会社_退職, 給与控除額Rec.前_健康保険料_会社_退職, 給与控除額Rec.差_健康保険料_会社_退職);

        rtn := C0930経理仕訳個人詳細データ取得(i_会社コード, i_給与支払年月_当月, i_給与支払年月_前月, 給与控除額Rec.GUI, '100', 'X13', 給与控除額Rec.介護保険料_会社_退職, 給与控除額Rec.前_介護保険料_会社_退職);
        差異 := 数値比較(差異, 給与控除額Rec.介護保険料_会社_退職, 給与控除額Rec.前_介護保険料_会社_退職, 給与控除額Rec.差_介護保険料_会社_退職);

        rtn := C0930経理仕訳個人詳細データ取得(i_会社コード, i_給与支払年月_当月, i_給与支払年月_前月, 給与控除額Rec.GUI, '100', 'X14', 給与控除額Rec.厚生年金保険料_会社_退職, 給与控除額Rec.前_厚生年金保険料_会社_退職);
        差異 := 数値比較(差異, 給与控除額Rec.厚生年金保険料_会社_退職, 給与控除額Rec.前_厚生年金保険料_会社_退職, 給与控除額Rec.差_厚生年金保険料_会社_退職);

        rtn := C0930経理仕訳個人詳細データ取得(i_会社コード, i_給与支払年月_当月, i_給与支払年月_前月, 給与控除額Rec.GUI, '100', 'X15', 給与控除額Rec.企業年金基金保険料_退職, 給与控除額Rec.前_企業年金基金保険料_退職);
        差異 := 数値比較(差異, 給与控除額Rec.企業年金基金保険料_退職, 給与控除額Rec.前_企業年金基金保険料_退職, 給与控除額Rec.差_企業年金基金保険料_退職);

        rtn := C0930経理仕訳個人詳細データ取得(i_会社コード, i_給与支払年月_当月, i_給与支払年月_前月, 給与控除額Rec.GUI, '100', 'X16', 給与控除額Rec.子ども子育て拠出金_退職, 給与控除額Rec.前_子ども子育て拠出金_退職);
        差異 := 数値比較(差異, 給与控除額Rec.子ども子育て拠出金_退職, 給与控除額Rec.前_子ども子育て拠出金_退職, 給与控除額Rec.差_子ども子育て拠出金_退職);

        rtn := C0930経理仕訳個人詳細データ取得(i_会社コード, i_給与支払年月_当月, i_給与支払年月_前月, 給与控除額Rec.GUI, '100', 'X17', 給与控除額Rec.健康保険料_会社_賞与, 給与控除額Rec.前_健康保険料_会社_賞与);
        差異 := 数値比較(差異, 給与控除額Rec.健康保険料_会社_賞与, 給与控除額Rec.前_健康保険料_会社_賞与, 給与控除額Rec.差_健康保険料_会社_賞与);

        rtn := C0930経理仕訳個人詳細データ取得(i_会社コード, i_給与支払年月_当月, i_給与支払年月_前月, 給与控除額Rec.GUI, '100', 'X18', 給与控除額Rec.介護保険料_会社_賞与, 給与控除額Rec.前_介護保険料_会社_賞与);
        差異 := 数値比較(差異, 給与控除額Rec.介護保険料_会社_賞与, 給与控除額Rec.前_介護保険料_会社_賞与, 給与控除額Rec.差_介護保険料_会社_賞与);

        rtn := C0930経理仕訳個人詳細データ取得(i_会社コード, i_給与支払年月_当月, i_給与支払年月_前月, 給与控除額Rec.GUI, '100', 'X19', 給与控除額Rec.厚生年金保険料_会社_賞与, 給与控除額Rec.前_厚生年金保険料_会社_賞与);
        差異 := 数値比較(差異, 給与控除額Rec.厚生年金保険料_会社_賞与, 給与控除額Rec.前_厚生年金保険料_会社_賞与, 給与控除額Rec.差_厚生年金保険料_会社_賞与);

        rtn := C0930経理仕訳個人詳細データ取得(i_会社コード, i_給与支払年月_当月, i_給与支払年月_前月, 給与控除額Rec.GUI, '100', 'X20', 給与控除額Rec.企業年金基金保険料_賞与, 給与控除額Rec.前_企業年金基金保険料_賞与);
        差異 := 数値比較(差異, 給与控除額Rec.企業年金基金保険料_賞与, 給与控除額Rec.前_企業年金基金保険料_賞与, 給与控除額Rec.差_企業年金基金保険料_賞与);

        rtn := C0930経理仕訳個人詳細データ取得(i_会社コード, i_給与支払年月_当月, i_給与支払年月_前月, 給与控除額Rec.GUI, '100', 'X21', 給与控除額Rec.子ども子育て拠出金_賞与, 給与控除額Rec.前_子ども子育て拠出金_賞与);
        差異 := 数値比較(差異, 給与控除額Rec.子ども子育て拠出金_賞与, 給与控除額Rec.前_子ども子育て拠出金_賞与, 給与控除額Rec.差_子ども子育て拠出金_賞与);

        rtn := C0930経理仕訳個人詳細データ取得(i_会社コード, i_給与支払年月_当月, i_給与支払年月_前月, 給与控除額Rec.GUI, '100', 'X22', 給与控除額Rec.雇用保険料_会社, 給与控除額Rec.前_雇用保険料_会社);
        差異 := 数値比較(差異, 給与控除額Rec.雇用保険料_会社, 給与控除額Rec.前_雇用保険料_会社, 給与控除額Rec.差_雇用保険料_会社);

        rtn := C0930経理仕訳個人詳細データ取得(i_会社コード, i_給与支払年月_当月, i_給与支払年月_前月, 給与控除額Rec.GUI, '100', 'X23', 給与控除額Rec.労災保険料, 給与控除額Rec.前_労災保険料);
        差異 := 数値比較(差異, 給与控除額Rec.労災保険料, 給与控除額Rec.前_労災保険料, 給与控除額Rec.差_労災保険料);

        rtn := C0930経理仕訳個人詳細データ取得(i_会社コード, i_給与支払年月_当月, i_給与支払年月_前月, 給与控除額Rec.GUI, '100', 'X24', 給与控除額Rec.石綿健康被害救済法一般拠出金, 給与控除額Rec.前_石綿健康被害救済一般拠出);
        差異 := 数値比較(差異, 給与控除額Rec.石綿健康被害救済法一般拠出金, 給与控除額Rec.前_石綿健康被害救済一般拠出, 給与控除額Rec.差_石綿健康被害救済一般拠出);

        BEGIN
            -- C0930前月当月給与控除額比較データ作成 
            INSERT INTO C0930前月当月給与控除額比較 VALUES (
                i_会社コード
                , i_給与支払年月_当月         -- 給与支払年月
                , 給与控除額Rec.GUI           -- GUI
                , 差異                        -- 差異
                , 給与控除額Rec.所属コード    -- 所属コード
                , 給与控除額Rec.所属名称      -- 所属名称
                , 給与控除額Rec.氏名          -- 氏名
                , 給与控除額Rec.氏名カナ      -- 氏名カナ
                , 給与控除額Rec.戸籍氏名      -- 戸籍氏名
                , 給与控除額Rec.戸籍氏名カナ  -- 戸籍氏名カナ
                , 給与控除額Rec.給与区分      -- 給与区分
                , 給与控除額Rec.雇用区分      -- 雇用区分
                , 給与控除額Rec.職掌          -- 職掌
                , 給与控除額Rec.職階          -- 職階
                , 給与控除額Rec.生年月日      -- 生年月日
                , 給与控除額Rec.年齢          -- 年齢
                , 給与控除額Rec.入社年月日    -- 入社年月日
                , 給与控除額Rec.入社年月日2   -- 入社年月日2
                , 給与控除額Rec.退職年月日    -- 退職年月日
                , 給与控除額Rec.休職年月日    -- 休職年月日
                , 給与控除額Rec.復職年月日    -- 復職年月日
                , 給与控除額Rec.出向区分      -- 出向区分
                , 給与控除額Rec.海外出向区分  -- 海外出向区分
                , 給与控除額Rec.税区分        -- 税区分
                , 給与控除額Rec.前_生保A      -- 前_生保A
                , 給与控除額Rec.生保A         -- 生保A
                , 給与控除額Rec.差_生保A      -- 差_生保A
                , 給与控除額Rec.前_変動001    -- 前_変動001
                , 給与控除額Rec.変動001       -- 変動001
                , 給与控除額Rec.差_変動001    -- 差_変動001
                , 給与控除額Rec.前_変動010    -- 前_変動010
                , 給与控除額Rec.変動010       -- 変動010
                , 給与控除額Rec.差_変動010    -- 差_変動010
                , 給与控除額Rec.前_変動016    -- 前_変動016
                , 給与控除額Rec.変動016       -- 変動016
                , 給与控除額Rec.差_変動016    -- 差_変動016
                , 給与控除額Rec.前_変動018    -- 前_変動018
                , 給与控除額Rec.変動018       -- 変動018
                , 給与控除額Rec.差_変動018    -- 差_変動018
                , 給与控除額Rec.前_変動025    -- 前_変動025
                , 給与控除額Rec.変動025       -- 変動025
                , 給与控除額Rec.差_変動025    -- 差_変動025
                , 給与控除額Rec.前_その他保険 -- 前_その他保険
                , 給与控除額Rec.その他保険    -- その他保険
                , 給与控除額Rec.差_その他保険 -- 差_その他保険
                , 給与控除額Rec.前_変動500    -- 前_変動500
                , 給与控除額Rec.変動500       -- 変動500
                , 給与控除額Rec.差_変動500    -- 差_変動500
                , 給与控除額Rec.前_変動501    -- 前_変動501
                , 給与控除額Rec.変動501       -- 変動501
                , 給与控除額Rec.差_変動501    -- 差_変動501
                , 給与控除額Rec.前_変動502    -- 前_変動502
                , 給与控除額Rec.変動502       -- 変動502
                , 給与控除額Rec.差_変動502    -- 差_変動502
                , 給与控除額Rec.前_変動503    -- 前_変動503
                , 給与控除額Rec.変動503       -- 変動503
                , 給与控除額Rec.差_変動503    -- 差_変動503
                , 給与控除額Rec.前_変動515    -- 前_変動515
                , 給与控除額Rec.変動515       -- 変動515
                , 給与控除額Rec.差_変動515    -- 差_変動515
                , 給与控除額Rec.前_変動516    -- 前_変動516
                , 給与控除額Rec.変動516       -- 変動516
                , 給与控除額Rec.差_変動516    -- 差_変動516
                , 給与控除額Rec.前_変動517    -- 前_変動517
                , 給与控除額Rec.変動517       -- 変動517
                , 給与控除額Rec.差_変動517    -- 差_変動517
                , 給与控除額Rec.前_変動518    -- 前_変動518
                , 給与控除額Rec.変動518       -- 変動518
                , 給与控除額Rec.差_変動518    -- 差_変動518
                , 給与控除額Rec.前_福プロ会費 -- 前_福プロ会費
                , 給与控除額Rec.福プロ会費    -- 福プロ会費
                , 給与控除額Rec.差_福プロ会費 -- 差_福プロ会費
                , 給与控除額Rec.前_組合費     -- 前_組合費
                , 給与控除額Rec.組合費        -- 組合費
                , 給与控除額Rec.差_組合費     -- 差_組合費
                , 給与控除額Rec.前_貯蓄A      -- 前_貯蓄A
                , 給与控除額Rec.貯蓄A         -- 貯蓄A
                , 給与控除額Rec.差_貯蓄A      -- 差_貯蓄A
                , 給与控除額Rec.前_変動200    -- 前_変動200
                , 給与控除額Rec.変動200       -- 変動200
                , 給与控除額Rec.差_変動200    -- 差_変動200
                , 給与控除額Rec.前_変動201    -- 前_変動201
                , 給与控除額Rec.変動201       -- 変動201
                , 給与控除額Rec.差_変動201    -- 差_変動201
                , 給与控除額Rec.前_変動202    -- 前_変動202
                , 給与控除額Rec.変動202       -- 変動202
                , 給与控除額Rec.差_変動202    -- 差_変動202
                , 給与控除額Rec.前_変動203    -- 前_変動203
                , 給与控除額Rec.変動203       -- 変動203
                , 給与控除額Rec.差_変動203    -- 差_変動203
                , 給与控除額Rec.前_変動204    -- 前_変動204
                , 給与控除額Rec.変動204       -- 変動204
                , 給与控除額Rec.差_変動204    -- 差_変動204
                , 給与控除額Rec.前_変動205    -- 前_変動205
                , 給与控除額Rec.変動205       -- 変動205
                , 給与控除額Rec.差_変動205    -- 差_変動205
                , 給与控除額Rec.前_変動206    -- 前_変動206
                , 給与控除額Rec.変動206       -- 変動206
                , 給与控除額Rec.差_変動206    -- 差_変動206
                , 給与控除額Rec.前_変動207    -- 前_変動207
                , 給与控除額Rec.変動207       -- 変動207
                , 給与控除額Rec.差_変動207    -- 差_変動207
                , 給与控除額Rec.前_変動208    -- 前_変動208
                , 給与控除額Rec.変動208       -- 変動208
                , 給与控除額Rec.差_変動208    -- 差_変動208
                , 給与控除額Rec.前_変動209    -- 前_変動209
                , 給与控除額Rec.変動209       -- 変動209
                , 給与控除額Rec.差_変動209    -- 差_変動209
                , 給与控除額Rec.前_変動210    -- 前_変動210
                , 給与控除額Rec.変動210       -- 変動210
                , 給与控除額Rec.差_変動210    -- 差_変動210
                , 給与控除額Rec.前_変動211    -- 前_変動211
                , 給与控除額Rec.変動211       -- 変動211
                , 給与控除額Rec.差_変動211    -- 差_変動211
                , 給与控除額Rec.前_変動212    -- 前_変動212
                , 給与控除額Rec.変動212       -- 変動212
                , 給与控除額Rec.差_変動212    -- 差_変動212
                , 給与控除額Rec.前_変動213    -- 前_変動213
                , 給与控除額Rec.変動213       -- 変動213
                , 給与控除額Rec.差_変動213    -- 差_変動213
                , 給与控除額Rec.前_変動214    -- 前_変動214
                , 給与控除額Rec.変動214       -- 変動214
                , 給与控除額Rec.差_変動214    -- 差_変動214
                , 給与控除額Rec.前_変動215    -- 前_変動215
                , 給与控除額Rec.変動215       -- 変動215
                , 給与控除額Rec.差_変動215    -- 差_変動215
                , 給与控除額Rec.前_変動216    -- 前_変動216
                , 給与控除額Rec.変動216       -- 変動216
                , 給与控除額Rec.差_変動216    -- 差_変動216
                , 給与控除額Rec.前_変動217    -- 前_変動217
                , 給与控除額Rec.変動217       -- 変動217
                , 給与控除額Rec.差_変動217    -- 差_変動217
                , 給与控除額Rec.前_変動223    -- 前_変動223
                , 給与控除額Rec.変動223       -- 変動223
                , 給与控除額Rec.差_変動223    -- 差_変動223
                , 給与控除額Rec.前_変動224    -- 前_変動224
                , 給与控除額Rec.変動224       -- 変動224
                , 給与控除額Rec.差_変動224    -- 差_変動224
                , 給与控除額Rec.前_貯蓄B      -- 前_貯蓄B
                , 給与控除額Rec.貯蓄B         -- 貯蓄B
                , 給与控除額Rec.差_貯蓄B      -- 差_貯蓄B
                , 給与控除額Rec.前_社宅寮費   -- 前_社宅寮費
                , 給与控除額Rec.社宅寮費      -- 社宅寮費
                , 給与控除額Rec.差_社宅寮費   -- 差_社宅寮費
                , 給与控除額Rec.前_変動260    -- 前_変動260
                , 給与控除額Rec.変動260       -- 変動260
                , 給与控除額Rec.差_変動260    -- 差_変動260
                , 給与控除額Rec.前_変動261    -- 前_変動261
                , 給与控除額Rec.変動261       -- 変動261
                , 給与控除額Rec.差_変動261    -- 差_変動261
                , 給与控除額Rec.前_変動262    -- 前_変動262
                , 給与控除額Rec.変動262       -- 変動262
                , 給与控除額Rec.差_変動262    -- 差_変動262
                , 給与控除額Rec.前_変動263    -- 前_変動263
                , 給与控除額Rec.変動263       -- 変動263
                , 給与控除額Rec.差_変動263    -- 差_変動263
                , 給与控除額Rec.前_変動264    -- 前_変動264
                , 給与控除額Rec.変動264       -- 変動264
                , 給与控除額Rec.差_変動264    -- 差_変動264
                , 給与控除額Rec.前_変動265    -- 前_変動265
                , 給与控除額Rec.変動265       -- 変動265
                , 給与控除額Rec.差_変動265    -- 差_変動265
                , 給与控除額Rec.前_変動266    -- 前_変動266
                , 給与控除額Rec.変動266       -- 変動266
                , 給与控除額Rec.差_変動266    -- 差_変動266
                , 給与控除額Rec.前_変動267    -- 前_変動267
                , 給与控除額Rec.変動267       -- 変動267
                , 給与控除額Rec.差_変動267    -- 差_変動267
                , 給与控除額Rec.前_変動268    -- 前_変動268
                , 給与控除額Rec.変動268       -- 変動268
                , 給与控除額Rec.差_変動268    -- 差_変動268
                , 給与控除額Rec.前_変動269    -- 前_変動269
                , 給与控除額Rec.変動269       -- 変動269
                , 給与控除額Rec.差_変動269    -- 差_変動269
                , 給与控除額Rec.前_変動270    -- 前_変動270
                , 給与控除額Rec.変動270       -- 変動270
                , 給与控除額Rec.差_変動270    -- 差_変動270
                , 給与控除額Rec.前_変動271    -- 前_変動271
                , 給与控除額Rec.変動271       -- 変動271
                , 給与控除額Rec.差_変動271    -- 差_変動271
                , 給与控除額Rec.前_変動272    -- 前_変動272
                , 給与控除額Rec.変動272       -- 変動272
                , 給与控除額Rec.差_変動272    -- 差_変動272
                , 給与控除額Rec.前_変動273    -- 前_変動273
                , 給与控除額Rec.変動273       -- 変動273
                , 給与控除額Rec.差_変動273    -- 差_変動273
                , 給与控除額Rec.前_変動274    -- 前_変動274
                , 給与控除額Rec.変動274       -- 変動274
                , 給与控除額Rec.差_変動274    -- 差_変動274
                , 給与控除額Rec.前_変動275    -- 前_変動275
                , 給与控除額Rec.変動275       -- 変動275
                , 給与控除額Rec.差_変動275    -- 差_変動275
                , 給与控除額Rec.前_変動276    -- 前_変動276
                , 給与控除額Rec.変動276       -- 変動276
                , 給与控除額Rec.差_変動276    -- 差_変動276
                , 給与控除額Rec.前_変動277    -- 前_変動277
                , 給与控除額Rec.変動277       -- 変動277
                , 給与控除額Rec.差_変動277    -- 差_変動277
                , 給与控除額Rec.前_変動278    -- 前_変動278
                , 給与控除額Rec.変動278       -- 変動278
                , 給与控除額Rec.差_変動278    -- 差_変動278
                , 給与控除額Rec.前_変動279    -- 前_変動279
                , 給与控除額Rec.変動279       -- 変動279
                , 給与控除額Rec.差_変動279    -- 差_変動279
                , 給与控除額Rec.前_変動280    -- 前_変動280
                , 給与控除額Rec.変動280       -- 変動280
                , 給与控除額Rec.差_変動280    -- 差_変動280
                , 給与控除額Rec.前_変動282    -- 前_変動282
                , 給与控除額Rec.変動282       -- 変動282
                , 給与控除額Rec.差_変動282    -- 差_変動282
                , 給与控除額Rec.前_変動283    -- 前_変動283
                , 給与控除額Rec.変動283       -- 変動283
                , 給与控除額Rec.差_変動283    -- 差_変動283
                , 給与控除額Rec.前_変動284    -- 前_変動284
                , 給与控除額Rec.変動284       -- 変動284
                , 給与控除額Rec.差_変動284    -- 差_変動284
                , 給与控除額Rec.前_変動285    -- 前_変動285
                , 給与控除額Rec.変動285       -- 変動285
                , 給与控除額Rec.差_変動285    -- 差_変動285
                , 給与控除額Rec.前_その他A    -- 前_その他A
                , 給与控除額Rec.その他A       -- その他A
                , 給与控除額Rec.差_その他A    -- 差_その他A
                , 給与控除額Rec.前_変動230    -- 前_変動230
                , 給与控除額Rec.変動230       -- 変動230
                , 給与控除額Rec.差_変動230    -- 差_変動230
                , 給与控除額Rec.前_変動231    -- 前_変動231
                , 給与控除額Rec.変動231       -- 変動231
                , 給与控除額Rec.差_変動231    -- 差_変動231
                , 給与控除額Rec.前_変動232    -- 前_変動232
                , 給与控除額Rec.変動232       -- 変動232
                , 給与控除額Rec.差_変動232    -- 差_変動232
                , 給与控除額Rec.前_変動233    -- 前_変動233
                , 給与控除額Rec.変動233       -- 変動233
                , 給与控除額Rec.差_変動233    -- 差_変動233
                , 給与控除額Rec.前_変動234    -- 前_変動234
                , 給与控除額Rec.変動234       -- 変動234
                , 給与控除額Rec.差_変動234    -- 差_変動234
                , 給与控除額Rec.前_変動235    -- 前_変動235
                , 給与控除額Rec.変動235       -- 変動235
                , 給与控除額Rec.差_変動235    -- 差_変動235
                , 給与控除額Rec.前_変動236    -- 前_変動236
                , 給与控除額Rec.変動236       -- 変動236
                , 給与控除額Rec.差_変動236    -- 差_変動236
                , 給与控除額Rec.前_変動237    -- 前_変動237
                , 給与控除額Rec.変動237       -- 変動237
                , 給与控除額Rec.差_変動237    -- 差_変動237
                , 給与控除額Rec.前_変動238    -- 前_変動238
                , 給与控除額Rec.変動238       -- 変動238
                , 給与控除額Rec.差_変動238    -- 差_変動238
                , 給与控除額Rec.前_変動239    -- 前_変動239
                , 給与控除額Rec.変動239       -- 変動239
                , 給与控除額Rec.差_変動239    -- 差_変動239
                , 給与控除額Rec.前_変動240    -- 前_変動240
                , 給与控除額Rec.変動240       -- 変動240
                , 給与控除額Rec.差_変動240    -- 差_変動240
                , 給与控除額Rec.前_変動241    -- 前_変動241
                , 給与控除額Rec.変動241       -- 変動241
                , 給与控除額Rec.差_変動241    -- 差_変動241
                , 給与控除額Rec.前_変動242    -- 前_変動242
                , 給与控除額Rec.変動242       -- 変動242
                , 給与控除額Rec.差_変動242    -- 差_変動242
                , 給与控除額Rec.前_変動243    -- 前_変動243
                , 給与控除額Rec.変動243       -- 変動243
                , 給与控除額Rec.差_変動243    -- 差_変動243
                , 給与控除額Rec.前_変動244    -- 前_変動244
                , 給与控除額Rec.変動244       -- 変動244
                , 給与控除額Rec.差_変動244    -- 差_変動244
                , 給与控除額Rec.前_変動245    -- 前_変動245
                , 給与控除額Rec.変動245       -- 変動245
                , 給与控除額Rec.差_変動245    -- 差_変動245
                , 給与控除額Rec.前_変動246    -- 前_変動246
                , 給与控除額Rec.変動246       -- 変動246
                , 給与控除額Rec.差_変動246    -- 差_変動246
                , 給与控除額Rec.前_変動247    -- 前_変動247
                , 給与控除額Rec.変動247       -- 変動247
                , 給与控除額Rec.差_変動247    -- 差_変動247
                , 給与控除額Rec.前_変動248    -- 前_変動248
                , 給与控除額Rec.変動248       -- 変動248
                , 給与控除額Rec.差_変動248    -- 差_変動248
                , 給与控除額Rec.前_変動249    -- 前_変動249
                , 給与控除額Rec.変動249       -- 変動249
                , 給与控除額Rec.差_変動249    -- 差_変動249
                , 給与控除額Rec.前_変動250    -- 前_変動250
                , 給与控除額Rec.変動250       -- 変動250
                , 給与控除額Rec.差_変動250    -- 差_変動250
                , 給与控除額Rec.前_変動251    -- 前_変動251
                , 給与控除額Rec.変動251       -- 変動251
                , 給与控除額Rec.差_変動251    -- 差_変動251
                , 給与控除額Rec.前_変動252    -- 前_変動252
                , 給与控除額Rec.変動252       -- 変動252
                , 給与控除額Rec.差_変動252    -- 差_変動252
                , 給与控除額Rec.前_変動253    -- 前_変動253
                , 給与控除額Rec.変動253       -- 変動253
                , 給与控除額Rec.差_変動253    -- 差_変動253
                , 給与控除額Rec.前_変動254    -- 前_変動254
                , 給与控除額Rec.変動254       -- 変動254
                , 給与控除額Rec.差_変動254    -- 差_変動254
                , 給与控除額Rec.前_その他B    -- 前_その他B
                , 給与控除額Rec.その他B       -- その他B
                , 給与控除額Rec.差_その他B    -- 差_その他B
                , 給与控除額Rec.前_変動330    -- 前_変動330
                , 給与控除額Rec.変動330       -- 変動330
                , 給与控除額Rec.差_変動330    -- 差_変動330
                , 給与控除額Rec.前_変動331    -- 前_変動331
                , 給与控除額Rec.変動331       -- 変動331
                , 給与控除額Rec.差_変動331    -- 差_変動331
                , 給与控除額Rec.前_変動332    -- 前_変動332
                , 給与控除額Rec.変動332       -- 変動332
                , 給与控除額Rec.差_変動332    -- 差_変動332
                , 給与控除額Rec.前_その他C    -- 前_その他C
                , 給与控除額Rec.その他C       -- その他C
                , 給与控除額Rec.差_その他C    -- 差_その他C
                , 給与控除額Rec.前_その他D    -- 前_その他D
                , 給与控除額Rec.その他D       -- その他D
                , 給与控除額Rec.差_その他D    -- 差_その他D
                , 給与控除額Rec.前_その他E    -- 前_その他E
                , 給与控除額Rec.その他E       -- その他E
                , 給与控除額Rec.差_その他E    -- 差_その他E
                , 給与控除額Rec.前_その他F    -- 前_その他F
                , 給与控除額Rec.その他F       -- その他F
                , 給与控除額Rec.差_その他F    -- 差_その他F
                , 給与控除額Rec.前_その他G    -- 前_その他G
                , 給与控除額Rec.その他G       -- その他G
                , 給与控除額Rec.差_その他G    -- 差_その他G
                , 給与控除額Rec.前_その他H    -- 前_その他H
                , 給与控除額Rec.その他H       -- その他H
                , 給与控除額Rec.差_その他H    -- 差_その他H
                , 給与控除額Rec.前_その他I    -- 前_その他I
                , 給与控除額Rec.その他I       -- その他I
                , 給与控除額Rec.差_その他I    -- 差_その他I
                , 給与控除額Rec.前_その他J    -- 前_その他J
                , 給与控除額Rec.その他J       -- その他J
                , 給与控除額Rec.差_その他J    -- 差_その他J
                , 給与控除額Rec.前_その他K    -- 前_その他K
                , 給与控除額Rec.その他K       -- その他K
                , 給与控除額Rec.差_その他K    -- 差_その他K
                , 給与控除額Rec.前_非課税控除合計    -- 前_非課税控除合計
                , 給与控除額Rec.非課税控除合計       -- 非課税控除合計
                , 給与控除額Rec.差_非課税控除合計    -- 差_非課税控除合計
                , 給与控除額Rec.前_通勤手当課税分    -- 前_通勤手当課税分
                , 給与控除額Rec.通勤手当課税分       -- 通勤手当課税分
                , 給与控除額Rec.差_通勤手当課税分    -- 差_通勤手当課税分
                , 給与控除額Rec.前_所得税対象額      -- 前_所得税対象額
                , 給与控除額Rec.所得税対象額         -- 所得税対象額
                , 給与控除額Rec.差_所得税対象額      -- 差_所得税対象額
                , 給与控除額Rec.前_雇用保険対象額    -- 前_雇用保険対象額
                , 給与控除額Rec.雇用保険対象額       -- 雇用保険対象額
                , 給与控除額Rec.差_雇用保険対象額    -- 差_雇用保険対象額
                , 給与控除額Rec.前_補助S数値11_4     -- 前_補助S数値11_4
                , 給与控除額Rec.補助S数値11_4        -- 補助S数値11_4
                , 給与控除額Rec.差_補助S数値11_4     -- 差_補助S数値11_4
                , 給与控除額Rec.前_健保料            -- 前_健保料
                , 給与控除額Rec.健保料               -- 健保料
                , 給与控除額Rec.差_健保料            -- 差_健保料
                , 給与控除額Rec.前_介護保険料        -- 前_介護保険料
                , 給与控除額Rec.介護保険料           -- 介護保険料
                , 給与控除額Rec.差_介護保険料        -- 差_介護保険料
                , 給与控除額Rec.前_厚保料            -- 前_厚保料
                , 給与控除額Rec.厚保料               -- 厚保料
                , 給与控除額Rec.差_厚保料            -- 差_厚保料
                , 給与控除額Rec.前_雇保料            -- 前_雇保料
                , 給与控除額Rec.雇保料               -- 雇保料
                , 給与控除額Rec.差_雇保料            -- 差_雇保料
                , 給与控除額Rec.前_所得税            -- 前_所得税
                , 給与控除額Rec.所得税               -- 所得税
                , 給与控除額Rec.差_所得税            -- 差_所得税
                , 給与控除額Rec.前_地方税            -- 前_地方税
                , 給与控除額Rec.地方税               -- 地方税
                , 給与控除額Rec.差_地方税            -- 差_地方税
                , 給与控除額Rec.前_社会保険控除合計  -- 前_社会保険控除合計
                , 給与控除額Rec.社会保険控除合計     -- 社会保険控除合計
                , 給与控除額Rec.差_社会保険控除合計  -- 差_社会保険控除合計
                , 給与控除額Rec.前_法定控除合計      -- 前_法定控除合計
                , 給与控除額Rec.法定控除合計         -- 法定控除合計
                , 給与控除額Rec.差_法定控除合計      -- 差_法定控除合計
                , 給与控除額Rec.前_総控除額          -- 前_総控除額
                , 給与控除額Rec.総控除額             -- 総控除額
                , 給与控除額Rec.差_総控除額          -- 差_総控除額
                , 給与控除額Rec.前_差し引き支給額    -- 前_差し引き支給額
                , 給与控除額Rec.差し引き支給額       -- 差し引き支給額
                , 給与控除額Rec.差_差し引き支給額    -- 差_差し引き支給額
                , 給与控除額Rec.前_健康保険料_会社_給与      -- 前_健康保険料_会社_給与
                , 給与控除額Rec.健康保険料_会社_給与         -- 健康保険料_会社_給与
                , 給与控除額Rec.差_健康保険料_会社_給与      -- 差_健康保険料_会社_給与
                , 給与控除額Rec.前_介護保険料_会社_給与      -- 前_介護保険料_会社_給与
                , 給与控除額Rec.介護保険料_会社_給与         -- 介護保険料_会社_給与
                , 給与控除額Rec.差_介護保険料_会社_給与      -- 差_介護保険料_会社_給与
                , 給与控除額Rec.前_厚生年金保険料_会社_給与  -- 前_厚生年金保険料_会社_給与
                , 給与控除額Rec.厚生年金保険料_会社_給与     -- 厚生年金保険料_会社_給与
                , 給与控除額Rec.差_厚生年金保険料_会社_給与  -- 差_厚生年金保険料_会社_給与
                , 給与控除額Rec.前_企業年金基金保険料_給与   -- 前_企業年金基金保険料_給与
                , 給与控除額Rec.企業年金基金保険料_給与      -- 企業年金基金保険料_給与
                , 給与控除額Rec.差_企業年金基金保険料_給与   -- 差_企業年金基金保険料_給与
                , 給与控除額Rec.前_子ども子育て拠出金_給与   -- 前_子ども子育て拠出金_給与
                , 給与控除額Rec.子ども子育て拠出金_給与      -- 子ども子育て拠出金_給与
                , 給与控除額Rec.差_子ども子育て拠出金_給与   -- 差_子ども子育て拠出金_給与
                , 給与控除額Rec.前_健康保険料_会社_退職      -- 前_健康保険料_会社_退職
                , 給与控除額Rec.健康保険料_会社_退職         -- 健康保険料_会社_退職
                , 給与控除額Rec.差_健康保険料_会社_退職      -- 差_健康保険料_会社_退職
                , 給与控除額Rec.前_介護保険料_会社_退職      -- 前_介護保険料_会社_退職
                , 給与控除額Rec.介護保険料_会社_退職         -- 介護保険料_会社_退職
                , 給与控除額Rec.差_介護保険料_会社_退職      -- 差_介護保険料_会社_退職
                , 給与控除額Rec.前_厚生年金保険料_会社_退職  -- 前_厚生年金保険料_会社_退職
                , 給与控除額Rec.厚生年金保険料_会社_退職     -- 厚生年金保険料_会社_退職
                , 給与控除額Rec.差_厚生年金保険料_会社_退職  -- 差_厚生年金保険料_会社_退職
                , 給与控除額Rec.前_企業年金基金保険料_退職   -- 前_企業年金基金保険料_退職
                , 給与控除額Rec.企業年金基金保険料_退職      -- 企業年金基金保険料_退職
                , 給与控除額Rec.差_企業年金基金保険料_退職   -- 差_企業年金基金保険料_退職
                , 給与控除額Rec.前_子ども子育て拠出金_退職   -- 前_子ども子育て拠出金_退職
                , 給与控除額Rec.子ども子育て拠出金_退職      -- 子ども子育て拠出金_退職
                , 給与控除額Rec.差_子ども子育て拠出金_退職   -- 差_子ども子育て拠出金_退職
                , 給与控除額Rec.前_健康保険料_会社_賞与      -- 前_健康保険料_会社_賞与
                , 給与控除額Rec.健康保険料_会社_賞与         -- 健康保険料_会社_賞与
                , 給与控除額Rec.差_健康保険料_会社_賞与      -- 差_健康保険料_会社_賞与
                , 給与控除額Rec.前_介護保険料_会社_賞与      -- 前_介護保険料_会社_賞与
                , 給与控除額Rec.介護保険料_会社_賞与         -- 介護保険料_会社_賞与
                , 給与控除額Rec.差_介護保険料_会社_賞与      -- 差_介護保険料_会社_賞与
                , 給与控除額Rec.前_厚生年金保険料_会社_賞与  -- 前_厚生年金保険料_会社_賞与
                , 給与控除額Rec.厚生年金保険料_会社_賞与     -- 厚生年金保険料_会社_賞与
                , 給与控除額Rec.差_厚生年金保険料_会社_賞与  -- 差_厚生年金保険料_会社_賞与
                , 給与控除額Rec.前_企業年金基金保険料_賞与   -- 前_企業年金基金保険料_賞与
                , 給与控除額Rec.企業年金基金保険料_賞与      -- 企業年金基金保険料_賞与
                , 給与控除額Rec.差_企業年金基金保険料_賞与   -- 差_企業年金基金保険料_賞与
                , 給与控除額Rec.前_子ども子育て拠出金_賞与   -- 前_子ども子育て拠出金_賞与
                , 給与控除額Rec.子ども子育て拠出金_賞与      -- 子ども子育て拠出金_賞与
                , 給与控除額Rec.差_子ども子育て拠出金_賞与   -- 差_子ども子育て拠出金_賞与
                , 給与控除額Rec.前_雇用保険料_会社           -- 前_雇用保険料_会社
                , 給与控除額Rec.雇用保険料_会社              -- 雇用保険料_会社
                , 給与控除額Rec.差_雇用保険料_会社           -- 差_雇用保険料_会社
                , 給与控除額Rec.前_労災保険料                -- 前_労災保険料
                , 給与控除額Rec.労災保険料                   -- 労災保険料
                , 給与控除額Rec.差_労災保険料                -- 差_労災保険料
                , 給与控除額Rec.前_石綿健康被害救済一般拠出  -- 前_石綿健康被害救済一般拠出
                , 給与控除額Rec.石綿健康被害救済法一般拠出金 -- 石綿健康被害救済法一般拠出金
                , 給与控除額Rec.差_石綿健康被害救済一般拠出  -- 差_石綿健康被害救済一般拠出
                ,SYSDATE           -- 登録日時
                ,i_担当者コード    -- 登録者
                ,NULL              -- 更新日時
                ,NULL              -- 更新者
            );
            EXCEPTION
                WHEN OTHERS THEN
                    oErrorMesg := '「C0930前月当月給与控除額比較」の登録に失敗しました。'
                               || '会社コード['
                               || i_会社コード
                               || ']'
                               || '給与支払年月['
                               || i_給与支払年月_当月
                               || ']'
                               || '社員番号['
                               || 給与明細マスタRec.社員番号
                               || ']'
                               || 'SQLERRM['
                               || sqlerrm(SQLCODE)
                               || ']';

                    -- エラー情報登録
                    KP930当月前月比較PKG.PUTERROR(
                                        i_プログラムid, 
                                        i_会社コード, 
                                        i_給与支払年月_当月, 
                                        i_給与支払年月_前月, 
                                        i_担当者コード, 
                                        給与控除額Rec.GUI, 
                                        oErrorMesg, '');

                    o_異常件数 := o_異常件数 + 1;
                    CONTINUE;
        END;
        
    END LOOP;
    
    -- 閉める
    CLOSE CUR給与明細マスタ;
    CLOSE CUR給与明細変動項目;
    
    -- 正常件数
    o_正常件数 := o_処理件数 - o_異常件数;

    -- 正常を戻す
    RETURN(rtn正常);
    
EXCEPTION
    WHEN 致命エラー THEN
        RETURN(rtn異常);
    WHEN OTHERS THEN
        oErrorMesg := '致命的なエラーが発生しました['
                      || SQLERRM(SQLCODE)
                      || ']';
        RETURN(rtn異常);
END KP930A07給与控除比較;